src/test/java/jmeter/tests/user/report/statistics.json
{
  "Get User" : {
    "transaction" : "Get User",
    "sampleCount" : 100,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 222.47999999999996,
    "medianResTime" : 214.5,
    "minResTime" : 131.0,
    "maxResTime" : 369.0,
    "pct1ResTime" : 318.9,
    "pct2ResTime" : 357.29999999999984,
    "pct3ResTime" : 368.91999999999996,
    "throughput" : 10.814318157240185,
    "receivedKBytesPerSec" : 5.280428787714935,
    "sentKBytesPerSec" : 2.0699280847842543
  },
  "Login User" : {
    "transaction" : "Login User",
    "sampleCount" : 100,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 225.06000000000003,
    "medianResTime" : 216.0,
    "minResTime" : 130.0,
    "maxResTime" : 368.0,
    "pct1ResTime" : 318.0,
    "pct2ResTime" : 340.0,
    "pct3ResTime" : 367.91999999999996,
    "throughput" : 10.782833728703903,
    "receivedKBytesPerSec" : 5.07551353245633,
    "sentKBytesPerSec" : 2.400865322406729
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 400,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 234.62249999999977,
    "medianResTime" : 217.0,
    "minResTime" : 130.0,
    "maxResTime" : 669.0,
    "pct1ResTime" : 327.0,
    "pct2ResTime" : 360.95,
    "pct3ResTime" : 548.96,
    "throughput" : 39.01297181312786,
    "receivedKBytesPerSec" : 16.715763069345556,
    "sentKBytesPerSec" : 9.829440163854482
  },
  "Create User" : {
    "transaction" : "Create User",
    "sampleCount" : 100,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 266.4599999999999,
    "medianResTime" : 245.0,
    "minResTime" : 131.0,
    "maxResTime" : 669.0,
    "pct1ResTime" : 507.1000000000008,
    "pct2ResTime" : 544.9,
    "pct3ResTime" : 667.9499999999995,
    "throughput" : 10.22390348635109,
    "receivedKBytesPerSec" : 3.9138380533687758,
    "sentKBytesPerSec" : 4.14347651058174
  },
  "Logout User" : {
    "transaction" : "Logout User",
    "sampleCount" : 100,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 224.48999999999995,
    "medianResTime" : 216.5,
    "minResTime" : 130.0,
    "maxResTime" : 367.0,
    "pct1ResTime" : 316.5000000000001,
    "pct2ResTime" : 340.95,
    "pct3ResTime" : 366.93999999999994,
    "throughput" : 10.737678513905294,
    "receivedKBytesPerSec" : 3.995171400193278,
    "sentKBytesPerSec" : 2.023800735530978
  }
}